#include <stdio.h>

int main()
{
    float f1 = 3.1415926;
    float f2 = 1234.1415926;
    float f3 = 124.1;
    printf("%3.4f\n", f1);
    printf("%3.4f\n", f2);
    printf("%3.4f\n", f3);
    printf("----------------\n");
    printf("(%m.nf) 打印至少m个字符宽度(包括小数点和小数部分的位数)，打印n位小数"); //
    printf("----------------\n");
    printf("%8.3f\n", 3.1415926);   // 打印"   3.142" 一共8位，前面3个空格
    printf("%2.6f\n", 3.1415926);   // 打印"3.141593"
    printf("%6.6f\n", 3.1415926);   // 打印"3.141593" 至少打印2个字符和6个字符 在这没区别
    printf("%6.4f\n", 3.1415926);   // 打印"3.1416"
    printf("%7.4f\n", 3.1415926);   // 打印" 3.1416"
    printf("%8.4f\n", 3.1415926);   // 打印"  3.1416" 前面打印两个空格
    printf("%2.9f\n", 3.1415926);   // 打印"3.1415926000"
    printf("%2.9f\n", 333.1415926); // 打印"3.1415926000" 小数位补0
    return 0;
}